ashkan2414/VALL-E/firmware/src/platform/stm32/g474xx/pch.h
#pragma once

// ============================================================================
// STM32 HAL & LL DRIVERS
// ============================================================================

#include "stm32g4xx_hal.h"

// Low Layer (LL) Drivers
#include "stm32g4xx_ll_adc.h"
#include "stm32g4xx_ll_bus.h"
#include "stm32g4xx_ll_comp.h"
#include "stm32g4xx_ll_cordic.h"
#include "stm32g4xx_ll_cortex.h"
#include "stm32g4xx_ll_crc.h"
#include "stm32g4xx_ll_crs.h"
#include "stm32g4xx_ll_dac.h"
#include "stm32g4xx_ll_dma.h"
#include "stm32g4xx_ll_dmamux.h"
#include "stm32g4xx_ll_exti.h"
#include "stm32g4xx_ll_fmac.h"
#include "stm32g4xx_ll_fmc.h"
#include "stm32g4xx_ll_gpio.h"
#include "stm32g4xx_ll_hrtim.h"
#include "stm32g4xx_ll_i2c.h"
#include "stm32g4xx_ll_iwdg.h"
#include "stm32g4xx_ll_lptim.h"
#include "stm32g4xx_ll_lpuart.h"
#include "stm32g4xx_ll_opamp.h"
#include "stm32g4xx_ll_pwr.h"
#include "stm32g4xx_ll_rcc.h"
#include "stm32g4xx_ll_rng.h"
#include "stm32g4xx_ll_rtc.h"
#include "stm32g4xx_ll_spi.h"
#include "stm32g4xx_ll_system.h"
#include "stm32g4xx_ll_tim.h"
#include "stm32g4xx_ll_ucpd.h"
#include "stm32g4xx_ll_usart.h"
#include "stm32g4xx_ll_usb.h"
#include "stm32g4xx_ll_utils.h"
#include "stm32g4xx_ll_wwdg.h"

// ============================================================================
// PROJECT CORE
// ============================================================================
// Only include headers here if they are STABLE (not changing often).

#ifdef __cplusplus

#include "valle/platform/core.hpp"
#include "valle/platform/devices/adc.hpp"
#include "valle/platform/devices/adc_common.hpp"
#include "valle/platform/devices/dma.hpp"
#include "valle/platform/devices/dmamux.hpp"
#include "valle/platform/devices/gpio.hpp"
#include "valle/platform/devices/hrtim.hpp"
#include "valle/platform/devices/i2c.hpp"
#include "valle/platform/devices/power.hpp"
#include "valle/platform/devices/rcc.hpp"
#include "valle/platform/devices/tim.hpp"
#include "valle/platform/devices/uart.hpp"
#include "valle/platform/system_interface/init.hpp"
#include "valle/platform/system_interface/sync.hpp"
#include "valle/platform/system_interface/timing.hpp"


#endif